Public Member Functions | List of all members
ACAPI::MEP::RoutingSegment::Modifier Class Reference
MEP Element Manager
Modifier of the RoutingSegment. More...
#include <MEPRoutingSegment.hpp>
 Inheritance diagram for ACAPI::MEP::RoutingSegment::Modifier:
 Public Member Functions
Result< void >  | SetCrossSectionWidth (double width)
Sets the width of the RoutingSegment.
Result< void >  | SetCrossSectionHeight (double height)
Sets the height of the Routing Segment.
Result< void >  | SetCrossSectionShape (ConnectorShape shape)
Sets the shape of the Routing Segment.
Result< void >  | SetCrossSectionReferenceId (uint32_t referenceId)
Sets the referenceId of Circular Cross Section in the Routing Segment.
Result< void >  | Inject (const RoutingSegmentDefault &routingSegmentDefault)
Injects the given Default settings to the RoutingSegment.
Result< void >  | SetRigidSegmentDefaultParameters (const RigidSegmentDefault &rigidSegmentDefault)
Sets the parameters of the RigidSegments.
Result< void >  | SetPreferenceTableId (const UniqueID &uniqueId)
Sets the PreferenceTable of the RoutingSegment.
void  | SetAnchor (API_AnchorID anchor)
Sets the anchor position of the RoutingSegment.
void  | SetReferenceLineOffsetX (double offset)
Sets the offset from the reference line along the X-axis of cross-section's plane.
void  | SetReferenceLineOffsetY (double offset)
Sets the offset from the reference line along the Y-axis of cross-section's plane.
Result< void >  | SetWallThickness (double thickness)
Sets the wall thickness of the RoutingSegment.
Result< void >  | SetConnectionStyle (ConnectionStyle connectionStyle)
Sets the connection style of the RoutingSegment.
Result< void >  | SetFlangeSize (double flangeSize)
Sets the flange size (width for Ventilation, diameter for Piping) of the RoutingSegment if its connection style is Flanged.
Detailed Description
Modifier of the RoutingSegment.
Member Function Documentation
◆ Inject()
 Result< void > ACAPI::MEP::RoutingSegment::Modifier::Inject  |  ( |  const RoutingSegmentDefault & |  routingSegmentDefault | )
Injects the given Default settings to the RoutingSegment.
Parameters
routingSegmentDefault | The Default which will be injected.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ SetAnchor()
 void ACAPI::MEP::RoutingSegment::Modifier::SetAnchor  |  ( |  API_AnchorID |  anchor | )
Sets the anchor position of the RoutingSegment.
Parameters
anchor | The value to be set.
◆ SetConnectionStyle()
 Result< void > ACAPI::MEP::RoutingSegment::Modifier::SetConnectionStyle  |  ( |  ConnectionStyle |  connectionStyle | )
Sets the connection style of the RoutingSegment.
Parameters
connectionStyle | The value to be set.
Returns
Returns an error if the RoutingSegment's domain does not support the provided connection style, otherwise nothing.
◆ SetCrossSectionHeight()
 Result< void > ACAPI::MEP::RoutingSegment::Modifier::SetCrossSectionHeight  |  ( |  double |  height | )
Sets the height of the Routing Segment.
Parameters
height | The value to be set.
Returns
Returns error if the Cross Section Shape is Circular, otherwise nothing.
◆ SetCrossSectionReferenceId()
 Result< void > ACAPI::MEP::RoutingSegment::Modifier::SetCrossSectionReferenceId  |  ( |  uint32_t |  referenceId | )
Sets the referenceId of Circular Cross Section in the Routing Segment.
Parameters
referenceId | The referenceId of the row from the Segment PreferenceTable. Only the valid row's ReferenceId can be set.
Returns
Returns an error if the Cross Section Shape is not Circular or the referenceId is not a valid row of the actual preferenceTable, otherwise nothing.
◆ SetCrossSectionShape()
 Result< void > ACAPI::MEP::RoutingSegment::Modifier::SetCrossSectionShape  |  ( |  ConnectorShape |  shape | )
Sets the shape of the Routing Segment.
Parameters
shape | The value to be set.
Returns
Returns error if the shape is not supported by the RoutingSegment, otherwise nothing.
◆ SetCrossSectionWidth()
 Result< void > ACAPI::MEP::RoutingSegment::Modifier::SetCrossSectionWidth  |  ( |  double |  width | )
Sets the width of the RoutingSegment.
Parameters
width | The value to be set.
Returns
Returns error if the Cross Section Shape is Circular, otherwise nothing.
◆ SetFlangeSize()
 Result< void > ACAPI::MEP::RoutingSegment::Modifier::SetFlangeSize  |  ( |  double |  flangeSize | )
Sets the flange size (width for Ventilation, diameter for Piping) of the RoutingSegment if its connection style is Flanged.
Parameters
flangeSize | The value to be set.
Returns
Returns an error if the RoutingSegment's connection style is not Flanged, otherwise nothing.
◆ SetPreferenceTableId()
 Result< void > ACAPI::MEP::RoutingSegment::Modifier::SetPreferenceTableId  |  ( |  const UniqueID & |  uniqueId | )
Sets the PreferenceTable of the RoutingSegment.
Parameters
uniqueId | The UniqueID of the PreferenceTable.
Returns
Returns an error if the parameter does not identify a PreferenceTable, otherwise nothing.
◆ SetReferenceLineOffsetX()
 void ACAPI::MEP::RoutingSegment::Modifier::SetReferenceLineOffsetX  |  ( |  double |  offset | )
Sets the offset from the reference line along the X-axis of cross-section's plane.
Parameters
offset | The value to be set.
◆ SetReferenceLineOffsetY()
 void ACAPI::MEP::RoutingSegment::Modifier::SetReferenceLineOffsetY  |  ( |  double |  offset | )
Sets the offset from the reference line along the Y-axis of cross-section's plane.
Parameters
offset | The value to be set.
◆ SetRigidSegmentDefaultParameters()
 Result< void > ACAPI::MEP::RoutingSegment::Modifier::SetRigidSegmentDefaultParameters  |  ( |  const RigidSegmentDefault & |  rigidSegmentDefault | )
Sets the parameters of the RigidSegments.
Parameters
rigidSegmentDefault | The Default to be set. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error in case of domain mismatch or if the set operation fails for some internal reason, otherwise nothing.
◆ SetWallThickness()
 Result< void > ACAPI::MEP::RoutingSegment::Modifier::SetWallThickness  |  ( |  double |  thickness | )
Sets the wall thickness of the RoutingSegment.
Parameters
thickness | The value to be set.
Returns
Returns an error if the RoutingSegment's wall thickness is controlled by its PreferenceTable, otherwise nothing.